{"reviewerID": "A2HD75EMZR8QLN", "asin": "0700099867", "reviewerName": "123", "helpful": [8, 12], "reviewText": "Installing the game was a struggle (because of games for windows live bugs).Some championship races and cars can only be \"unlocked\" by buying them as an addon to the game. I paid nearly 30 dollars when the game was new. I don't like the idea that I have to keep paying to keep playing.I noticed no improvement in the physics or graphics compared to Dirt 2.I tossed it in the garbage and vowed never to buy another codemasters game. I'm really tired of arcade style rally/racing games anyway.I'll continue to get my fix from Richard Burns Rally, and you should to. :)http://www.amazon.com/Richard-Burns-Rally-PC/dp/B000C97156/ref=sr_1_1?ie=UTF8&qid;=1341886844&sr;=8-1&keywords;=richard+burns+rallyThank you for reading my review! If you enjoyed it, be sure to rate it as helpful.", "overall": 1.0, "summary": "Pay to unlock content? I don't think so.", "unixReviewTime": 1341792000, "reviewTime": "07 9, 2012"}
{"reviewerID": "ABRCMQ9PO4T73", "asin": "0700099867", "helpful": [5, 18], "reviewText": "1st shipment received a book instead of the game.2nd shipment got a FAKE one. Game arrived with a wrong key inside on sealed box. I got in contact with codemasters and send them pictures of the DVD and the content. They said nothing they can do its a fake DVD.Returned it good bye. I hate it when that happens!", "overall": 3.0, "summary": "Wrong key", "unixReviewTime": 1362009600, "reviewTime": "02 28, 2013"}
{"reviewerID": "A2PJOSU5ND84S1", "asin": "6050036071", "reviewerName": "LaTavia E.", "helpful": [0, 0], "reviewText": "I love it! Use it all the time. Really works perfectly with all games that you need a mic for.", "overall": 5.0, "summary": "USB microphone", "unixReviewTime": 1396656000, "reviewTime": "04 5, 2014"}
{"reviewerID": "A361M14PU2GUEG", "asin": "0700099867", "reviewerName": "Angry Ryan \"Ryan A. Forrest\"", "helpful": [2, 2], "reviewText": "I had Dirt 2 on Xbox 360 and it was an okay game. I started playing games on my laptop and bought a few new games to build my collection. This game is very fun to play. It is so much better than Dirt 2. If you like racing games you should check this out. The graphics are perfect on my compter.", "overall": 4.0, "summary": "DIRT 3", "unixReviewTime": 1308009600, "reviewTime": "06 14, 2011"}
{"reviewerID": "AQTC623NCESZW", "asin": "1700099867", "reviewerName": "Chesty Puller", "helpful": [1, 4], "reviewText": "I can't tell you what a piece of dog**** this game is. Like everything else Microsoft makes- it doesn't work. When are they going to take a cue from Apple and make things that actually work the first time and every time. To log onto this game they make you jump through a series of hoops that takes like 15 min. to accomplish. If you want another disappointment from Microsoft, buy some \"Games for Windows Live\" games.  I just wanted a simple arcade like driving game when I have a young boy visiting. If that's what you want, don't buy this. If you want to hire a consultant to help you run this game, then buy it.  oh, one more thing, every time I do get this game to play my joystick stops working (there's Windows 7 for you)", "overall": 3.0, "summary": "Crash 3 is correct name AKA Microsoft", "unixReviewTime": 1353715200, "reviewTime": "11 24, 2012"}
{"reviewerID": "AP0JOJSGM5SUR", "asin": "9625990674", "reviewerName": "b", "helpful": [0, 1], "reviewText": "its looks awesome but the down side is that it kinda slides when playing with the controller but still like it", "overall": 3.0, "summary": "Nice But.....", "unixReviewTime": 1360540800, "reviewTime": "02 11, 2013"}
{"reviewerID": "AN3YYDZAS3O1Y", "asin": "1700099867", "reviewerName": "Bob", "helpful": [0, 1], "reviewText": "I initially gave this one star because it was crashing on me constantly but I recently narrowed it down to a plug-in I was using for my porsche wheel. Game plays well and looks gorgeous when image spanned across three monitors. I would have loved to give it five stars if it wasn't for the annoying Microsoft Games for Live application that makes you go through hoops to set it up and causes problems of it's own (occasional crashes)", "overall": 4.0, "summary": "A great game ruined by Microsoft's account management system", "unixReviewTime": 1352851200, "reviewTime": "11 14, 2012"}
{"reviewerID": "A2JLT2WY0F2HVI", "asin": "0700099867", "reviewerName": "D. Sweetapple", "helpful": [1, 1], "reviewText": "I still haven't figured this one out. Did everything as instructed but the game never installed. Strange. Since I don't like to rate on something I couldn't get to work, I'll just say that I didn't like it because I couldn't get it to work :P For those that did manage to get it installed, I'm sure it's a great game. I had the first Dirt and it was a scream! Too bad this one bombed. Maybe a bad disc...", "overall": 2.0, "summary": "Couldn't get this one to work", "unixReviewTime": 1391817600, "reviewTime": "02 8, 2014"}
{"reviewerID": "AHT34BRYFBFT1", "asin": "0700099867", "reviewerName": "hewimp", "helpful": [0, 1], "reviewText": "Dirt 3 on DVDi collect racing games so had to add this to my collectionSon wated one also", "overall": 5.0, "summary": "Cars", "unixReviewTime": 1388275200, "reviewTime": "12 29, 2013"}
{"reviewerID": "AN3YYDZAS3O1Y", "asin": "0700099867", "reviewerName": "Bob", "helpful": [11, 13], "reviewText": "Loved playing Dirt 2 and I thought the graphics were good.  Purchased Dirt 3 as an addition to the other...and the graphics are absolutely \"Gorgeous\"  If you liked Dirt or Dirt 2...you are going to love Dirt 3.  The game was easier to configure with my Logitech wireless rumblepad...and with my EVGA GTX 580, and all detail set to full on graphics at 1920 x 1080 I get over 100 fps.  The game looks good, plays well and is a blast!", "overall": 5.0, "summary": "A step up from Dirt 2 and that is terrific!", "unixReviewTime": 1313280000, "reviewTime": "08 14, 2011"}
{"reviewerID": "A2UMFJ6CJAY5GX", "asin": "9625990674", "reviewerName": "Alex", "helpful": [0, 1], "reviewText": "nice cheap made cover it doesnt fot very tight but it does the job if you want to extend the life of your controller this is it", "overall": 3.0, "summary": "cover", "unixReviewTime": 1320796800, "reviewTime": "11 9, 2011"}
{"reviewerID": "ABRCMQ9PO4T73", "asin": "9625990674", "helpful": [26, 30], "reviewText": "covers the controller more then others and is pretty durable, great grip to it as well and keeps its color, looks solid.", "overall": 5.0, "summary": "fits great", "unixReviewTime": 1366329600, "reviewTime": "04 19, 2013"}
{"reviewerID": "A2OOR605L7T9EB", "asin": "9625990674", "reviewerName": "Bruce M. Wrona \"ace\"", "helpful": [0, 0], "reviewText": "nice skin for xbox controllers makes them more slip free and smooth softer too good deal and nice stuff try one", "overall": 5.0, "summary": "feels great", "unixReviewTime": 1322179200, "reviewTime": "11 25, 2011"}
{"reviewerID": "A1EHO1RWGS9ALN", "asin": "B00005BOSF", "reviewerName": "Ramiran2", "helpful": [3, 18], "reviewText": "if it had the rumble it would be perfect . . . . . . . . . . .", "overall": 5.0, "summary": "feels great", "unixReviewTime": 1319760000, "reviewTime": "10 28, 2011"}
{"reviewerID": "AN3YYDZAS3O1Y", "asin": "B00000DMB5", "reviewerName": "Bob", "helpful": [19, 23], "reviewText": "The biggest grip that I had was the controls.  They just didn't feel right and I got killed more often then not just trying to walk or jump.  Alltogether a decent game though.", "overall": 3.0, "summary": "Good graphics great game speed.", "unixReviewTime": 1096588800, "reviewTime": "10 1, 2004"}
